main:
    addi $2, $0, 5          # 初始化 $2 = 5
    addi $3, $0, 12         # 初始化 $3 = 12
    addi $7, $3, -9         # 初始化 $7 = 3
    or $4, $7, $2     # $4 <- $7 or $2 = -9 or 5 = -9
    and $5, $3, $4    # $5 <- $3 and $4 = 12 and -9 = 4
    add $5, $5, $4    # $5 <- $5 + $4 = 4 + -9 = -5
    beq $5, $7, end   # 如果 $5 == $7 跳转到 end (不应该跳转)
    slt $4, $3, $4    # $4 <- $3 < $4 = 12 < -9 = 0
    beq $4, $0, around # 如果 $4 != 0 跳转到 around (应该跳转)
    addi $5, $0, 0    # 不应该执行
around:
    slt $4, $7, $2    # $4 <- $7 < $2 = -9 < 5 = 1
    add $7, $4, $5    # $7 <- $4 + $5 = 1 + -5 = -4
    sub $7, $7, $2    # $7 <- $7 - $2 = -4 - 5 = -9
    sw $7, 68($3)     # 将 $7 存储到内存地址 $3 + 68
    lw $2, 80($0)     # 将内存地址 80 的值加载到 $2
	j end
	addi $2, $0, 1
end: sw $2, 84($0)     # 将 $2 存储到内存地址 84
	lw $1, 84($0)     # 将内存地址 84 的值加载到 $1